app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` WHERE (title LIKE('%%'))
---
  def search
    @posts = Post.search(params[:search])

INSERT INTO `posts` (`title`, `text`, `created_at`, `updated_at`, `user_id`) VALUES ('skateboard-1', 'sss', '2020-10-18 18:14:48', '2020-10-18 18:14:48', 1)
UPDATE `posts` SET `updated_at` = '2020-10-18 18:14:49' WHERE `posts`.`id` = 1
---
  def create
    @post = Post.create(post_params)
    if @post.save

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 4 LIMIT 1
---
  def update
    post = Post.find(params[:id])